kai-wang99/STM32F407/src/stm32f4xx_cubee.c
	return 0;
}

int  BSP_UART3_Receive(uint8_t *buf)
{
	int len = 0;
	BaseType_t xResult;
	xResult = xQueueReceive(xUart3RcvQueue, &aRxCharBuf, 10);
	if(pdPASS == xResult)
	{
	    *buf = aRxCharBuf;
	    len = 1;
	}
	return len;
}

void BSP_UART3_TxCpltCallback(UART_HandleTypeDef *UartHandle)
{
	if(UartHandle->Instance != USART3)
		return;

	Uart3Ready_T = SET;
}

void BSP_UART3_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
    BaseType_t xResult;
    if(UartHandle->Instance != USART3)
    	return;

    xResult = xQueueSendFromISR(xUart3RcvQueue, &aRxBuffer,NULL);
    if(pdPASS != xResult)
    {
    }
    HAL_UART_Receive_IT(UartHandle, (uint8_t *)&aRxBuffer, 1);
}

void BSP_UART3_ErrorCallback(UART_HandleTypeDef *UartHandle)
{
	//char errmsg = '!';

	if(UartHandle->Instance != USART3)
		return;
	//BSP_UART3_Send((uint8_t *)&errmsg, 1);
}

#endif /* HAL_UART_MODULE_ENABLED */


#ifdef HAL_ETH_MODULE_ENABLED
void BSP_ETH_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;

	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOD_CLK_ENABLE();

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(ETH_RESET_GPIO_Port, ETH_RESET_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin : ETH_RESET_Pin */
	GPIO_InitStruct.Pin = ETH_RESET_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(ETH_RESET_GPIO_Port, &GPIO_InitStruct);

}

#endif /* HAL_ETH_MODULE_ENABLED */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void BSP_Error_Handler(char *file, int line)
{
  UNUSED(file); /* Prevent unused argument(s) compilation warning */
  UNUSED(line); /* Prevent unused argument(s) compilation warning */
  while(1)
  {
  }
}
/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */    

/**
  * @}
  */ 
    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
